from django import forms


class CartAddProductForm(forms.Form):
    """
    პროდუქტის კალათში დამატების ფორმა.

    ველები:
    -- quantity: პროდუქტის რაოდენობა კალათში.
    -- override: თუ True-ია, შეცვლის პროდუქტის რაოდენობას კალათში, წინააღმდეგ შემთხვევაში დაამატებს.
    """

    quantity = forms.IntegerField(
        min_value=1,          # მინიმალური მნიშვნელობა 1, რადგან პროდუქტის რაოდენობა 0 ან უარყოფითი არ შეიძლება
        max_value=20,         # მაქსიმალური მნიშვნელობა 20, რადგან პროდუქტის რაოდენობა 20-ზე მეტი არ შეიძლება
        initial=1,            # საწყისი მნიშვნელობა 1, რადგან პროდუქტის მინიმალური რაოდენობა 1-ია
        widget=forms.NumberInput(attrs={
            'class': 'form-control',
            'placeholder': 'რაოდენობა'
        })
    )

    override = forms.BooleanField(
      required=False,       # აუცილებელი არ არის, რადგან მომხმარებელს არ სჭირდება ყოველთვის რაოდენობის შეცვლა
      initial=False,        # საწყისი მნიშვნელობა False, რადგან მომხმარებელს არ სჭირდება ყოველთვის რაოდენობის შეცვლა
      widget=forms.HiddenInput    # დამალული ველი, რადგან მომხმარებელს არ სჭირდება მისი ნახვა
    )